app/views/pets/_form.html.erb

    <%= f.label :animal %><br />
    <%= select(:pet, :animal_id, Animal.all.collect {|a| [a.genus + " " + a.species, a.id ]}) %>
---
SELECT `animals`.* FROM `animals`