app/views/notifications/_form.html.erb

    <%= f.label :destination %><br />
    <%= collection_select(:notification, :destination_id, Pet.where('user_id <> ?', current_user.id), :id, :name, :selected => params[:destination]) %>
---
SELECT `pets`.* FROM `pets` WHERE (`pets`.user_id = 1)