app/controllers/animals_controller.rb

SELECT `animals`.* FROM `animals`
---
  def index
    @animals = Animal.all

SELECT `animals`.* FROM `animals` WHERE (`animals`.`id` = 1) LIMIT 1
---
  def edit
    if current_user and current_user.admin
      @animal = Animal.find(params[:id])

INSERT INTO `animals` (`created_at`, `genus`, `species`, `updated_at`) VALUES ('2010-10-31 05:54:00', 'g', 's', '2010-10-31 05:54:00')
---
  def create
    unless current_user and current_user.admin
      return render_forbidden
    end
    @animal = Animal.new(params[:animal])

    respond_to do |format|
      if @animal.save

SELECT `animals`.* FROM `animals` WHERE (`animals`.`id` = 1) LIMIT 1
---
  def show
    @animal = Animal.find(params[:id])