app/controllers/notifications_controller.rb

SELECT `notifications`.* FROM `notifications` INNER JOIN `pets` ON `pets`.`id` = `notifications`.`destination_id` WHERE (`pets`.`user_id` = 2) ORDER BY notifications.read
---
  def index
    @notifications = Notification.joins(:destination).where('pets.user_id' => current_user.id).order('notifications.read')

SELECT `notifications`.* FROM `notifications` WHERE (`notifications`.`id` = 2) LIMIT 1
UPDATE `notifications` SET `read` = 1, `updated_at` = '2010-11-29 18:23:32' WHERE (`notifications`.`id` = 5)
---
  def show
    @notification = Notification.find(params[:id])
    if @notification.destination.user == current_user
      @notification.read = true
      @notification.save

INSERT INTO `notifications` (`contents`, `created_at`, `destination_id`, `read`, `source_id`, `time`, `updated_at`) VALUES ('hello', '2010-11-29 16:32:55', NULL, 0, NULL, '2010-11-29 16:32:55', '2010-11-29 16:32:55')
---
  def create
    @notification = Notification.new(params[:notification])
    @notification.time = Time.new
    @notification.read = false
    respond_to do |format|
      if @notification.save

SELECT `notifications`.* FROM `notifications` WHERE (`notifications`.`id` = 1) LIMIT 1
DELETE FROM `notifications` WHERE (`notifications`.`id` = 1)
---
  def destroy
    @notification = Notification.find(params[:id])
    @notification.destroy