app/controllers/pets_controller.rb

SELECT `pets`.* FROM `pets` WHERE (`pets`.user_id = 1)
---
  def index
    @pets = Pet.all

SELECT `pets`.* FROM `pets` WHERE (`pets`.`id` = 1) LIMIT 1
---
  def show
    @pet = Pet.find(params[:id])

SELECT `pets`.* FROM `pets` WHERE (`pets`.`id` = 1) LIMIT 1
---
  def edit
    @pet = Pet.find(params[:id])

INSERT INTO `pets` (`age`, `animal_id`, `created_at`, `gender`, `name`, `personality`, `updated_at`, `user_id`) VALUES (NULL, 2, '2010-11-25 16:18:10', 'Male', 'Duke', 'Silly', '2010-11-25 16:18:10', 1)
UPDATE `pets` SET `age` = 7, `updated_at` = '2010-11-25 16:18:10' WHERE (`pets`.`id` = 4)
---
  def create
    unless current_user
      render_forbidden
    end
    @pet = current_user.pets.create(params[:pet])

    respond_to do |format|
      if @pet.save

SELECT `pets`.* FROM `pets` WHERE (`pets`.`id` = 1) LIMIT 1
UPDATE `pets` SET `gender` = 'Male', `personality` = 'silly', `updated_at` = '2010-10-31 19:22:58' WHERE (`pets`.`id` = 1)
---
  def update
    @pet = Pet.find(params[:id])
    unless @pet.user == current_user
      render_forbidden
    end
    respond_to do |format|
      if @pet.update_attributes(params[:pet])

SELECT `pets`.* FROM `pets` WHERE (`pets`.`id` = 1) LIMIT 1
DELETE FROM `pets` WHERE (`pets`.`id` = 1)
---
  def destroy
    @pet = Pet.find(params[:id])
    unless @pet.user == current_user
      render_forbidden
    end
    @pet.destroy