app/controllers/search_controller.rb

  def index
    @query = params[:query]
    @pets = Pet.where('name LIKE "%' + @query + '%"')
---
SELECT `pets`.* FROM `pets` WHERE (name LIKE "%undefined%")