app/controllers/users_controller.rb

  def index
    if current_user and current_user.admin
      @users = User.all
---
SELECT `users`.* FROM `users`

  def show
    if current_user and current_user.admin
      @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def edit
    unless current_user and current_user.admin
      @user = current_user
    else
      @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`address`, `admin`, `created_at`, `crypted_password`, `email`, `name`, `password_salt`, `persistence_token`, `updated_at`, `username`) VALUES ('1306 N Lincoln', 1, '2010-10-30 19:21:01', '66619feb74165fd98932b45fb41886c6c9aa4130a1e643f7abd3c4cf74b05e239482efa36357f7e8b8c067e00b36dda2d272fa8b1e16afb1650a85286d6bbec2', 'pschorf2@gmail.com', 'Paul Schorfheide', 'MUdLvf6nvqeakV2I8da', '698919c600c48ccdcc5fb5d8c27402f011509c4a64d3d685cf4d3c45b961adfab81674b333350122da61f621ca138e73638f02233a2ea871e1b636c76fbfd286', '2010-10-30 19:21:01', 'pschorf')

  def update
    @attrs = params[:user]
    unless current_user and current_user.admin
      @user = current_user
      @attrs[:admin] = false
    else
      @user = User.find(params[:id])
    end
    respond_to do |format|
      if @user.update_attributes(@attrs)
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `email` = 'juser@example.org', `updated_at` = '2010-10-31 04:53:10' WHERE (`users`.`id` = 2)